src/test/resources/fetchAvailableAppointmentSlotsRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:soap1="http://soap.integration.fsm.comarch.com/">
   <soap:Header/>
   <soap:Body>
      <soap1:fetchAvailableAppointmentSlots>
         <query>
            <sourceSystem>?</sourceSystem>
            <processId>?</processId>
            <processCreationDate>?</processCreationDate>
            <orderType>?</orderType>
            <orderTechnology>?</orderTechnology>
            <!--Optional:-->
            <inventory>
               <!--Optional:-->
               <node>
                  <nodeId>?</nodeId>
               </node>
               <!--Optional:-->
               <devices>
                  <!--1 or more repetitions:-->
                  <device>
                     <deviceId>?</deviceId>
                     <deviceName>?</deviceName>
                     <deviceFullName>?</deviceFullName>
                     <!--Optional:-->
                     <serialNumber>?</serialNumber>
                     <!--Optional:-->
                     <macAddress>?</macAddress>
                     <!--Optional:-->
                     <attributes>
                        <!--1 or more repetitions:-->
                        <attribute>
                           <name>?</name>
                           <!--1 or more repetitions:-->
                           <value>?</value>
                        </attribute>
                     </attributes>
                  </device>
               </devices>
               <!--Optional:-->
               <services>
                  <!--1 or more repetitions:-->
                  <service>
                     <serviceId>?</serviceId>
                     <serviceName>?</serviceName>
                     <serviceFullName>?</serviceFullName>
                     <!--Optional:-->
                     <attributes>
                        <!--1 or more repetitions:-->
                        <attribute>
                           <name>?</name>
                           <!--1 or more repetitions:-->
                           <value>?</value>
                        </attribute>
                     </attributes>
                  </service>
               </services>
            </inventory>
            <location>
               <!--Optional:-->
               <locationId>?</locationId>
               <administrationUnit>
                  <!--Optional:-->
                  <id>?</id>
                  <level>?</level>
                  <name>?</name>
                  <!--Optional:-->
                  <administrationUnit/>
               </administrationUnit>
               <!--Optional:-->
               <cityId>?</cityId>
               <cityName>?</cityName>
               <!--Optional:-->
               <cityAdministrationUnit>
                  <!--Optional:-->
                  <id>?</id>
                  <level>?</level>
                  <name>?</name>
                  <!--Optional:-->
                  <administrationUnit/>
               </cityAdministrationUnit>
               <!--Optional:-->
               <streetId>?</streetId>
               <!--Optional:-->
               <streetName>?</streetName>
               <!--Optional:-->
               <buildingNo>?</buildingNo>
               <!--Optional:-->
               <flatNo>?</flatNo>
               <!--Optional:-->
               <longitude>?</longitude>
               <!--Optional:-->
               <latitude>?</latitude>
               <!--Optional:-->
               <description>?</description>
            </location>
            <!--Optional:-->
            <customer>
               <customerId>?</customerId>
               <customerType>?</customerType>
               <!--Optional:-->
               <firstName>?</firstName>
               <!--Optional:-->
               <lastName>?</lastName>
               <!--Optional:-->
               <businessName>?</businessName>
               <!--Optional:-->
               <phoneNumber1>?</phoneNumber1>
               <!--Optional:-->
               <phoneNumber2>?</phoneNumber2>
               <!--Optional:-->
               <phoneNumber3>?</phoneNumber3>
               <!--Optional:-->
               <email>?</email>
               <!--Optional:-->
               <contacts>
                  <!--1 or more repetitions:-->
                  <contact>
                     <name>?</name>
                     <!--1 or more repetitions:-->
                     <value>?</value>
                  </contact>
               </contacts>
               <!--Optional:-->
               <location>
                  <!--Optional:-->
                  <locationId>?</locationId>
                  <administrationUnit>
                     <!--Optional:-->
                     <id>?</id>
                     <level>?</level>
                     <name>?</name>
                     <!--Optional:-->
                     <administrationUnit/>
                  </administrationUnit>
                  <!--Optional:-->
                  <cityId>?</cityId>
                  <cityName>?</cityName>
                  <!--Optional:-->
                  <cityAdministrationUnit>
                     <!--Optional:-->
                     <id>?</id>
                     <level>?</level>
                     <name>?</name>
                     <!--Optional:-->
                     <administrationUnit/>
                  </cityAdministrationUnit>
                  <!--Optional:-->
                  <streetId>?</streetId>
                  <!--Optional:-->
                  <streetName>?</streetName>
                  <!--Optional:-->
                  <buildingNo>?</buildingNo>
                  <!--Optional:-->
                  <flatNo>?</flatNo>
                  <!--Optional:-->
                  <longitude>?</longitude>
                  <!--Optional:-->
                  <latitude>?</latitude>
                  <!--Optional:-->
                  <description>?</description>
               </location>
               <!--Optional:-->
               <attributes>
                  <!--1 or more repetitions:-->
                  <attribute>
                     <name>?</name>
                     <!--1 or more repetitions:-->
                     <value>?</value>
                  </attribute>
               </attributes>
            </customer>
            <!--Optional:-->
            <additionalRequirements>
               <!--Optional:-->
               <executorRole>?</executorRole>
               <!--Optional:-->
               <executors>
                  <!--1 or more repetitions:-->
                  <executor>
                     <executorId>?</executorId>
                  </executor>
               </executors>
               <!--Optional:-->
               <sla>?</sla>
               <!--Optional:-->
               <additionalSkills>
                  <!--1 or more repetitions:-->
                  <skill>?</skill>
               </additionalSkills>
            </additionalRequirements>
            <interval>
               <dateFrom>?</dateFrom>
               <dateTo>?</dateTo>
            </interval>
            <!--Optional:-->
            <additionalTaskTypes>
               <!--1 or more repetitions:-->
               <taskType>?</taskType>
            </additionalTaskTypes>
         </query>
      </soap1:fetchAvailableAppointmentSlots>
   </soap:Body>
</soap:Envelope>